load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Warm up peak load"
  engines:
    socketio: {}

scenarios:
  - name: "Simulate student joining and chatting"
    engine: socketio
    flow:
      - emit:
          channel: "CHAT_MESSAGE"
          data:
            text: "Hello from artillery load test!"
      - think: 5
      - emit:
          channel: "RAISE_HAND"
          data:
            isRaised: true
      - think: 2
      - emit:
          channel: "CHAT_MESSAGE"
          data:
            text: "My hand is raised."
      - think: 10